---
kind: other
id: Methods.T:Autodesk.Revit.DB.GeometryElement
source: html/efd03158-fd55-804d-f5ce-5aa67494b521.htm
---
# GeometryElement Methods

Causes the object to release immediately any resources it may be utilizing.